require("snacks").setup {
  -- more beautiful vim.ui.input
  input = {
    enabled = true,
    win = {
      relative = "cursor",
      backdrop = true,
    },
  },
  -- more beautiful vim.ui.select
  picker = { enabled = true },
  -- startup dashboard
  dashboard = {
    enabled = true,
    preset = {
      header = [[
███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║
██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║
██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║
╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝]],
    },
  },
}
